src/main/resources/templates/xml/create_issuing_contract_v2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:wsin="http://www.openwaygroup.com/wsint"
                  xmlns:th="http://www.thymeleaf.org">
    <soapenv:Header>
        <wsin:UserInfo th:text="${userInfo}">officer="WX_ADMIN"</wsin:UserInfo>
    </soapenv:Header>
    <soapenv:Body>
        <wsin:CreateIssuingContractWithLiabilityV2>
            <wsin:LiabCategory th:text="${liabCategory}">A</wsin:LiabCategory>
            <wsin:LiabContractSearchMethod th:text="${liabMethod}">CONTRACT_NUMBER</wsin:LiabContractSearchMethod>
            <wsin:LiabContractIdentifier th:text="${liabIdentifier}">001-P-354274</wsin:LiabContractIdentifier>
            <wsin:ClientSearchMethod th:text="${clientMethod}">CLIENT_NUMBER</wsin:ClientSearchMethod>
            <wsin:ClientIdentifier th:text="${clientIdentifier}">1</wsin:ClientIdentifier>
            <wsin:ProductIdentifier th:text="${productIdentifier}">250314000000000000000590</wsin:ProductIdentifier>
            <wsin:ApplRegNumber th:text="${applRegNumber}">REQ-001</wsin:ApplRegNumber>
            <wsin:InObject>
                <wsin:Branch th:text="${branch}">0101</wsin:Branch>
                <wsin:InstitutionCode th:text="${insCode}">0001</wsin:InstitutionCode>
                <wsin:Currency th:text="${currency}">810</wsin:Currency>
                <wsin:ContractName th:text="${contractName}">NGUYEN VAN B</wsin:ContractName>
            </wsin:InObject>
        </wsin:CreateIssuingContractWithLiabilityV2>
    </soapenv:Body>
</soapenv:Envelope>